org/2021-31.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021 年第 31 周总结
#+DATE: <2021-08-01 Sun>
7.26-8.1

周一：

- [X] JavaScript
  [[https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/JavaScript_basics]]
- [X] What is programming? [[https://youtu.be/N2bXEUSAiTI]]

  - 写代码的人是翻译人员，把人类需求，翻译成代码

- [X] Learning How to Learn
  [[https://www.coursera.org/learn/learning-how-to-learn/supplement/0PXPI/welcome-and-course-information]]

周二：

- [X] Pracrise WebGL
  [[https://developer.mozilla.org/en-US/docs/Web/API/WebGL_API/Tutorial/Creating_3D_objects_using_WebGL]]
  (学习 canvas [[https://github.com/bxm0927/canvas-special]])

周三：

- [X] 整理互联网公司列表
- [X] 每天阅读2篇英文长文
- [X] 每日CSS画画

周四：

- [X] 配置 GitHub Codespaces 初始环境
  [[https://blog.yidajiabei.xyz/posts/github-codespaces-initial-setup/]]
- [X] 找适合自己的方法
  [[https://blog.yidajiabei.xyz/posts/find-my-own-way]]
- [X] 每天阅读2篇英文长文：人生苦短
  [[https://blog.yidajiabei.xyz/posts/life-is-short]] Theranos
  标志着硅谷泡沫的顶峰吗？
  [[https://blog.yidajiabei.xyz/posts/does-theranos-mark-the-peak-of-the-silicon-valley-bubble/]]
- [X] How the Web works
  [[https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/How_the_Web_works]]
- [X] 每日CSS画画 [[https://codepen.io/yidajiabei/pen/NWjYZze]]

凌晨一点半睡觉

周五：

- [X] Intro to Vue3
  [[https://www.vuemastery.com/courses/intro-to-vue-3/intro-to-vue3]]
- [X] 前端实习生培训计划
  [[https://github.com/hjzheng/intern-training-plan]]
- [X] [[https://github.com/tianheg/blog/issues/119][读《刀锋》]]

周六：

- [X] 把flomo中的梦境发布出来
  [[https://blog.yidajiabei.xyz/posts/many-dreams/]]
- [X]
  [[https://github.com/tianheg/blog/issues/120][让博客的导航栏固定在窗口的边缘]]
- [X] DNS_PROBE_FINISHED_NXDOMAIN
  [[https://blog.yidajiabei.xyz/posts/fix-dns-probe-finished-nxdomain/]]
- [X] [[https://github.com/tianheg/blog/issues/121][play-nb]] #121
- [X] [[https://github.com/tianheg/blog/issues/122][Saving the Liberal
  Arts 拯救通识教育]]
- [X]
  [[https://blog.yidajiabei.xyz/posts/add-non-root-user-to-dev-container/][将
  non-root 用户添加到开发容器中]]
- [X] [[https://blog.yidajiabei.xyz/posts/use-xwmx-nb/][使用 xwmx/nb]]
- [X] [[https://blog.yidajiabei.xyz/posts/thoracic-diaphragm/][横隔膜]]
- [X]
  [[https://blog.yidajiabei.xyz/posts/fix-dns-probe-finished-nxdomain/][解决
  DNS_PROBE_FINISHED_NXDOMAIN]]

周日：

- [X]
  [[https://www.vuemastery.com/courses/intro-to-vue-3/intro-to-vue3]]
