blog/2021/2021-31.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 18:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 31 周总结</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 31 周总结</h1>
</header><p>
7.26-8.1
</p>

<p>
周一：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> JavaScript
<a href="https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/JavaScript_basics">https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/JavaScript_basics</a></li>
<li class="on"><code>[X]</code> What is programming? <a href="https://youtu.be/N2bXEUSAiTI">https://youtu.be/N2bXEUSAiTI</a>

<ul class="org-ul">
<li>写代码的人是翻译人员，把人类需求，翻译成代码</li>
</ul></li>

<li class="on"><code>[X]</code> Learning How to Learn
<a href="https://www.coursera.org/learn/learning-how-to-learn/supplement/0PXPI/welcome-and-course-information">https://www.coursera.org/learn/learning-how-to-learn/supplement/0PXPI/welcome-and-course-information</a></li>
</ul>

<p>
周二：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Pracrise WebGL
<a href="https://developer.mozilla.org/en-US/docs/Web/API/WebGL_API/Tutorial/Creating_3D_objects_using_WebGL">https://developer.mozilla.org/en-US/docs/Web/API/WebGL_API/Tutorial/Creating_3D_objects_using_WebGL</a>
(学习 canvas <a href="https://github.com/bxm0927/canvas-special">https://github.com/bxm0927/canvas-special</a>)</li>
</ul>

<p>
周三：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 整理互联网公司列表</li>
<li class="on"><code>[X]</code> 每天阅读 2 篇英文长文</li>
<li class="on"><code>[X]</code> 每日 CSS 画画</li>
</ul>

<p>
周四：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 配置 GitHub Codespaces 初始环境
<a href="https://blog.yidajiabei.xyz/posts/github-codespaces-initial-setup/">https://blog.yidajiabei.xyz/posts/github-codespaces-initial-setup/</a></li>
<li class="on"><code>[X]</code> 找适合自己的方法
<a href="https://blog.yidajiabei.xyz/posts/find-my-own-way">https://blog.yidajiabei.xyz/posts/find-my-own-way</a></li>
<li class="on"><code>[X]</code> 每天阅读 2 篇英文长文：人生苦短
<a href="https://blog.yidajiabei.xyz/posts/life-is-short">https://blog.yidajiabei.xyz/posts/life-is-short</a> Theranos
标志着硅谷泡沫的顶峰吗？
<a href="https://blog.yidajiabei.xyz/posts/does-theranos-mark-the-peak-of-the-silicon-valley-bubble/">https://blog.yidajiabei.xyz/posts/does-theranos-mark-the-peak-of-the-silicon-valley-bubble/</a></li>
<li class="on"><code>[X]</code> How the Web works
<a href="https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/How_the_Web_works">https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/How_the_Web_works</a></li>
<li class="on"><code>[X]</code> 每日 CSS 画画 <a href="https://codepen.io/yidajiabei/pen/NWjYZze">https://codepen.io/yidajiabei/pen/NWjYZze</a></li>
</ul>

<p>
凌晨一点半睡觉
</p>

<p>
周五：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Intro to Vue3
<a href="https://www.vuemastery.com/courses/intro-to-vue-3/intro-to-vue3">https://www.vuemastery.com/courses/intro-to-vue-3/intro-to-vue3</a></li>
<li class="on"><code>[X]</code> 前端实习生培训计划
<a href="https://github.com/hjzheng/intern-training-plan">https://github.com/hjzheng/intern-training-plan</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/119">读《刀锋》</a></li>
</ul>

<p>
周六：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 把 flomo 中的梦境发布出来
<a href="https://blog.yidajiabei.xyz/posts/many-dreams/">https://blog.yidajiabei.xyz/posts/many-dreams/</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/120">让博客的导航栏固定在窗口的边缘</a></li>
<li class="on"><code>[X]</code> DNS_PROBE_FINISHED_NXDOMAIN
<a href="https://blog.yidajiabei.xyz/posts/fix-dns-probe-finished-nxdomain/">https://blog.yidajiabei.xyz/posts/fix-dns-probe-finished-nxdomain/</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/121">play-nb</a> #121</li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/122">Saving the Liberal
Arts 拯救通识教育</a></li>
<li class="on"><code>[X]</code> <a href="https://blog.yidajiabei.xyz/posts/add-non-root-user-to-dev-container/">将
non-root 用户添加到开发容器中</a></li>
<li class="on"><code>[X]</code> <a href="https://blog.yidajiabei.xyz/posts/use-xwmx-nb/">使用 xwmx/nb</a></li>
<li class="on"><code>[X]</code> <a href="https://blog.yidajiabei.xyz/posts/thoracic-diaphragm/">横隔膜</a></li>
<li class="on"><code>[X]</code> <a href="https://blog.yidajiabei.xyz/posts/fix-dns-probe-finished-nxdomain/">解决
DNS_PROBE_FINISHED_NXDOMAIN</a></li>
</ul>

<p>
周日：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="https://www.vuemastery.com/courses/intro-to-vue-3/intro-to-vue3">https://www.vuemastery.com/courses/intro-to-vue-3/intro-to-vue3</a></li>
</ul>
</div>
</body>
</html>